weifengdq/embedded/tc364/0_Board_Test_CAN_x8/Libraries/Infra/Sfr/TC36x/IfxPsi5_reg.h
/**
 * \file IfxPsi5_reg.h
 * \brief
 * \version iLLD_1_20_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC36XA_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Psi5_Registers_Cfg Psi5 address
 * \ingroup IfxSfr_Psi5_Registers
 * 
 * \defgroup IfxSfr_Psi5_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Psi5_Registers_Cfg
 *
 * \defgroup IfxSfr_Psi5_Registers_Cfg_Psi5 2-PSI5
 * \ingroup IfxSfr_Psi5_Registers_Cfg
 *
 *
 */
#ifndef IFXPSI5_REG_H
#define IFXPSI5_REG_H 1
/******************************************************************************/
#include "IfxPsi5_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Psi5_Registers_Cfg_BaseAddress
 * \{  */

/** \brief PSI5 object */
#define MODULE_PSI5 /*lint --e(923, 9078)*/ ((*(Ifx_PSI5*)0xF0005000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Psi5_Registers_Cfg_Psi5
 * \{  */
/** \brief 0, Clock Control Register */
#define PSI5_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CLC*)0xF0005000u)

/** \brief 8, Module Identification Register */
#define PSI5_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_ID*)0xF0005008u)

/** \brief C, PSI5 Fractional Divider Register */
#define PSI5_FDR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_FDR*)0xF000500Cu)

/** \brief 10, Fractional Divider Register for Lower Bit Rate */
#define PSI5_FDRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_FDRL*)0xF0005010u)

/** \brief 14, Fractional Divider Register for Higher Bit Rate */
#define PSI5_FDRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_FDRH*)0xF0005014u)

/** \brief 18, Fractional Divider Register for Time Stamp */
#define PSI5_FDRT /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_FDRT*)0xF0005018u)

/** \brief 1C, Module Time Stamp Register A */
#define PSI5_TSRA /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TSRA*)0xF000501Cu)

/** \brief 20, Time Stamp Register B */
#define PSI5_TSRB /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TSRB*)0xF0005020u)

/** \brief 24, Module Time Stamp Register C */
#define PSI5_TSRC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TSRC*)0xF0005024u)

/** \brief 2C, Global Control Register */
#define PSI5_GCR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_GCR*)0xF000502Cu)

/** \brief 30, Input and Output Control Register 0 */
#define PSI5_CH0_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_IOCR*)0xF0005030u)
/** Alias (User Manual Name) for PSI5_CH0_IOCR.
* To use register names with standard convension, please use PSI5_CH0_IOCR.
*/
#define PSI5_IOCR0 (PSI5_CH0_IOCR)

/** \brief 34, Receiver Control Register A 0 */
#define PSI5_CH0_RCRA /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RCRA*)0xF0005034u)
/** Alias (User Manual Name) for PSI5_CH0_RCRA.
* To use register names with standard convension, please use PSI5_CH0_RCRA.
*/
#define PSI5_RCRA0 (PSI5_CH0_RCRA)

/** \brief 38, Receiver Control Register B 0 */
#define PSI5_CH0_RCRB /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RCRB*)0xF0005038u)
/** Alias (User Manual Name) for PSI5_CH0_RCRB.
* To use register names with standard convension, please use PSI5_CH0_RCRB.
*/
#define PSI5_RCRB0 (PSI5_CH0_RCRB)

/** \brief 3C, Receiver Control Register C 0 */
#define PSI5_CH0_RCRC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RCRC*)0xF000503Cu)
/** Alias (User Manual Name) for PSI5_CH0_RCRC.
* To use register names with standard convension, please use PSI5_CH0_RCRC.
*/
#define PSI5_RCRC0 (PSI5_CH0_RCRC)

/** \brief 40, Watch Dog Timer Register 00 */
#define PSI5_CH0_WDT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005040u)
/** Alias (User Manual Name) for PSI5_CH0_WDT0.
* To use register names with standard convension, please use PSI5_CH0_WDT0.
*/
#define PSI5_WDT00 (PSI5_CH0_WDT0)

/** \brief 44, Watch Dog Timer Register 01 */
#define PSI5_CH0_WDT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005044u)
/** Alias (User Manual Name) for PSI5_CH0_WDT1.
* To use register names with standard convension, please use PSI5_CH0_WDT1.
*/
#define PSI5_WDT01 (PSI5_CH0_WDT1)

/** \brief 48, Watch Dog Timer Register 02 */
#define PSI5_CH0_WDT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005048u)
/** Alias (User Manual Name) for PSI5_CH0_WDT2.
* To use register names with standard convension, please use PSI5_CH0_WDT2.
*/
#define PSI5_WDT02 (PSI5_CH0_WDT2)

/** \brief 4C, Watch Dog Timer Register 03 */
#define PSI5_CH0_WDT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF000504Cu)
/** Alias (User Manual Name) for PSI5_CH0_WDT3.
* To use register names with standard convension, please use PSI5_CH0_WDT3.
*/
#define PSI5_WDT03 (PSI5_CH0_WDT3)

/** \brief 50, Watch Dog Timer Register 04 */
#define PSI5_CH0_WDT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005050u)
/** Alias (User Manual Name) for PSI5_CH0_WDT4.
* To use register names with standard convension, please use PSI5_CH0_WDT4.
*/
#define PSI5_WDT04 (PSI5_CH0_WDT4)

