weifengdq/embedded/tc364/0_Board_Test_CAN_x8/Libraries/Infra/Sfr/TC36x/IfxPsi5_reg.h
/** \brief A4, Send Output Register Low 0 */
#define PSI5_CH0_SORL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SORL*)0xF00050A4u)
/** Alias (User Manual Name) for PSI5_CH0_SORL.
* To use register names with standard convension, please use PSI5_CH0_SORL.
*/
#define PSI5_SORL0 (PSI5_CH0_SORL)

/** \brief A8, Send Output Register High 0 */
#define PSI5_CH0_SORH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SORH*)0xF00050A8u)
/** Alias (User Manual Name) for PSI5_CH0_SORH.
* To use register names with standard convension, please use PSI5_CH0_SORH.
*/
#define PSI5_SORH0 (PSI5_CH0_SORH)

/** \brief C0, Input and Output Control Register 1 */
#define PSI5_CH1_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_IOCR*)0xF00050C0u)
/** Alias (User Manual Name) for PSI5_CH1_IOCR.
* To use register names with standard convension, please use PSI5_CH1_IOCR.
*/
#define PSI5_IOCR1 (PSI5_CH1_IOCR)

/** \brief C4, Receiver Control Register A 1 */
#define PSI5_CH1_RCRA /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RCRA*)0xF00050C4u)
/** Alias (User Manual Name) for PSI5_CH1_RCRA.
* To use register names with standard convension, please use PSI5_CH1_RCRA.
*/
#define PSI5_RCRA1 (PSI5_CH1_RCRA)

/** \brief C8, Receiver Control Register B 1 */
#define PSI5_CH1_RCRB /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RCRB*)0xF00050C8u)
/** Alias (User Manual Name) for PSI5_CH1_RCRB.
* To use register names with standard convension, please use PSI5_CH1_RCRB.
*/
#define PSI5_RCRB1 (PSI5_CH1_RCRB)

/** \brief CC, Receiver Control Register C 1 */
#define PSI5_CH1_RCRC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RCRC*)0xF00050CCu)
/** Alias (User Manual Name) for PSI5_CH1_RCRC.
* To use register names with standard convension, please use PSI5_CH1_RCRC.
*/
#define PSI5_RCRC1 (PSI5_CH1_RCRC)

/** \brief D0, Watch Dog Timer Register 10 */
#define PSI5_CH1_WDT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00050D0u)
/** Alias (User Manual Name) for PSI5_CH1_WDT0.
* To use register names with standard convension, please use PSI5_CH1_WDT0.
*/
#define PSI5_WDT10 (PSI5_CH1_WDT0)

/** \brief D4, Watch Dog Timer Register 11 */
#define PSI5_CH1_WDT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00050D4u)
/** Alias (User Manual Name) for PSI5_CH1_WDT1.
* To use register names with standard convension, please use PSI5_CH1_WDT1.
*/
#define PSI5_WDT11 (PSI5_CH1_WDT1)

/** \brief D8, Watch Dog Timer Register 12 */
#define PSI5_CH1_WDT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00050D8u)
/** Alias (User Manual Name) for PSI5_CH1_WDT2.
* To use register names with standard convension, please use PSI5_CH1_WDT2.
*/
#define PSI5_WDT12 (PSI5_CH1_WDT2)

/** \brief DC, Watch Dog Timer Register 13 */
#define PSI5_CH1_WDT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00050DCu)
/** Alias (User Manual Name) for PSI5_CH1_WDT3.
* To use register names with standard convension, please use PSI5_CH1_WDT3.
*/
#define PSI5_WDT13 (PSI5_CH1_WDT3)

/** \brief E0, Watch Dog Timer Register 14 */
#define PSI5_CH1_WDT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00050E0u)
/** Alias (User Manual Name) for PSI5_CH1_WDT4.
* To use register names with standard convension, please use PSI5_CH1_WDT4.
*/
#define PSI5_WDT14 (PSI5_CH1_WDT4)

/** \brief E4, Watch Dog Timer Register 15 */
#define PSI5_CH1_WDT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00050E4u)
/** Alias (User Manual Name) for PSI5_CH1_WDT5.
* To use register names with standard convension, please use PSI5_CH1_WDT5.
*/
#define PSI5_WDT15 (PSI5_CH1_WDT5)

/** \brief E8, Watch Dog Timer Register 16 */
#define PSI5_CH1_WDT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00050E8u)
/** Alias (User Manual Name) for PSI5_CH1_WDT6.
* To use register names with standard convension, please use PSI5_CH1_WDT6.
*/
#define PSI5_WDT16 (PSI5_CH1_WDT6)

/** \brief EC, Receive Status Register 1 */
#define PSI5_CH1_RSR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RSR*)0xF00050ECu)
/** Alias (User Manual Name) for PSI5_CH1_RSR.
* To use register names with standard convension, please use PSI5_CH1_RSR.
*/
#define PSI5_RSR1 (PSI5_CH1_RSR)

/** \brief F0, Serial Data and Status Register 10 */
#define PSI5_CH1_SDS0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF00050F0u)
/** Alias (User Manual Name) for PSI5_CH1_SDS0.
* To use register names with standard convension, please use PSI5_CH1_SDS0.
*/
#define PSI5_SDS10 (PSI5_CH1_SDS0)

/** \brief F4, Serial Data and Status Register 11 */
#define PSI5_CH1_SDS1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF00050F4u)
/** Alias (User Manual Name) for PSI5_CH1_SDS1.
* To use register names with standard convension, please use PSI5_CH1_SDS1.
*/
#define PSI5_SDS11 (PSI5_CH1_SDS1)

/** \brief F8, Serial Data and Status Register 12 */
#define PSI5_CH1_SDS2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF00050F8u)
/** Alias (User Manual Name) for PSI5_CH1_SDS2.
* To use register names with standard convension, please use PSI5_CH1_SDS2.
*/
#define PSI5_SDS12 (PSI5_CH1_SDS2)

/** \brief FC, Serial Data and Status Register 13 */
#define PSI5_CH1_SDS3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF00050FCu)
/** Alias (User Manual Name) for PSI5_CH1_SDS3.
* To use register names with standard convension, please use PSI5_CH1_SDS3.
*/
#define PSI5_SDS13 (PSI5_CH1_SDS3)

/** \brief 100, Serial Data and Status Register 14 */
#define PSI5_CH1_SDS4 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005100u)
/** Alias (User Manual Name) for PSI5_CH1_SDS4.
* To use register names with standard convension, please use PSI5_CH1_SDS4.
*/
#define PSI5_SDS14 (PSI5_CH1_SDS4)

/** \brief 104, Serial Data and Status Register 15 */
#define PSI5_CH1_SDS5 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005104u)
/** Alias (User Manual Name) for PSI5_CH1_SDS5.
* To use register names with standard convension, please use PSI5_CH1_SDS5.
*/
#define PSI5_SDS15 (PSI5_CH1_SDS5)

/** \brief 108, Start of Pulse Time Stamp Capture Register 1 */
#define PSI5_CH1_SPTSC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SPTSC*)0xF0005108u)
/** Alias (User Manual Name) for PSI5_CH1_SPTSC.
* To use register names with standard convension, please use PSI5_CH1_SPTSC.
*/
#define PSI5_SPTSC1 (PSI5_CH1_SPTSC)

