weifengdq/embedded/tc364/0_Board_Test_CAN_x8/Libraries/Infra/Sfr/TC36x/IfxPsi5_reg.h
/** \brief 684, Receive Data Memory High 016 */
#define PSI5_RDM0_16_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005684u)
/** Alias (User Manual Name) for PSI5_RDM0_16_H.
* To use register names with standard convension, please use PSI5_RDM0_16_H.
*/
#define PSI5_RDMH016 (PSI5_RDM0_16_H)

/** \brief 688, Receive Data Memory Low 017 */
#define PSI5_RDM0_17_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005688u)
/** Alias (User Manual Name) for PSI5_RDM0_17_L.
* To use register names with standard convension, please use PSI5_RDM0_17_L.
*/
#define PSI5_RDML017 (PSI5_RDM0_17_L)

/** \brief 68C, Receive Data Memory High 017 */
#define PSI5_RDM0_17_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000568Cu)
/** Alias (User Manual Name) for PSI5_RDM0_17_H.
* To use register names with standard convension, please use PSI5_RDM0_17_H.
*/
#define PSI5_RDMH017 (PSI5_RDM0_17_H)

/** \brief 690, Receive Data Memory Low 018 */
#define PSI5_RDM0_18_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005690u)
/** Alias (User Manual Name) for PSI5_RDM0_18_L.
* To use register names with standard convension, please use PSI5_RDM0_18_L.
*/
#define PSI5_RDML018 (PSI5_RDM0_18_L)

/** \brief 694, Receive Data Memory High 018 */
#define PSI5_RDM0_18_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005694u)
/** Alias (User Manual Name) for PSI5_RDM0_18_H.
* To use register names with standard convension, please use PSI5_RDM0_18_H.
*/
#define PSI5_RDMH018 (PSI5_RDM0_18_H)

/** \brief 698, Receive Data Memory Low 019 */
#define PSI5_RDM0_19_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005698u)
/** Alias (User Manual Name) for PSI5_RDM0_19_L.
* To use register names with standard convension, please use PSI5_RDM0_19_L.
*/
#define PSI5_RDML019 (PSI5_RDM0_19_L)

/** \brief 69C, Receive Data Memory High 019 */
#define PSI5_RDM0_19_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000569Cu)
/** Alias (User Manual Name) for PSI5_RDM0_19_H.
* To use register names with standard convension, please use PSI5_RDM0_19_H.
*/
#define PSI5_RDMH019 (PSI5_RDM0_19_H)

/** \brief 6A0, Receive Data Memory Low 020 */
#define PSI5_RDM0_20_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00056A0u)
/** Alias (User Manual Name) for PSI5_RDM0_20_L.
* To use register names with standard convension, please use PSI5_RDM0_20_L.
*/
#define PSI5_RDML020 (PSI5_RDM0_20_L)

/** \brief 6A4, Receive Data Memory High 020 */
#define PSI5_RDM0_20_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00056A4u)
/** Alias (User Manual Name) for PSI5_RDM0_20_H.
* To use register names with standard convension, please use PSI5_RDM0_20_H.
*/
#define PSI5_RDMH020 (PSI5_RDM0_20_H)

/** \brief 6A8, Receive Data Memory Low 021 */
#define PSI5_RDM0_21_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00056A8u)
/** Alias (User Manual Name) for PSI5_RDM0_21_L.
* To use register names with standard convension, please use PSI5_RDM0_21_L.
*/
#define PSI5_RDML021 (PSI5_RDM0_21_L)

/** \brief 6AC, Receive Data Memory High 021 */
#define PSI5_RDM0_21_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00056ACu)
/** Alias (User Manual Name) for PSI5_RDM0_21_H.
* To use register names with standard convension, please use PSI5_RDM0_21_H.
*/
#define PSI5_RDMH021 (PSI5_RDM0_21_H)

/** \brief 6B0, Receive Data Memory Low 022 */
#define PSI5_RDM0_22_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00056B0u)
/** Alias (User Manual Name) for PSI5_RDM0_22_L.
* To use register names with standard convension, please use PSI5_RDM0_22_L.
*/
#define PSI5_RDML022 (PSI5_RDM0_22_L)

/** \brief 6B4, Receive Data Memory High 022 */
#define PSI5_RDM0_22_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00056B4u)
/** Alias (User Manual Name) for PSI5_RDM0_22_H.
* To use register names with standard convension, please use PSI5_RDM0_22_H.
*/
#define PSI5_RDMH022 (PSI5_RDM0_22_H)

/** \brief 6B8, Receive Data Memory Low 023 */
#define PSI5_RDM0_23_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00056B8u)
/** Alias (User Manual Name) for PSI5_RDM0_23_L.
* To use register names with standard convension, please use PSI5_RDM0_23_L.
*/
#define PSI5_RDML023 (PSI5_RDM0_23_L)

/** \brief 6BC, Receive Data Memory High 023 */
#define PSI5_RDM0_23_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00056BCu)
/** Alias (User Manual Name) for PSI5_RDM0_23_H.
* To use register names with standard convension, please use PSI5_RDM0_23_H.
*/
#define PSI5_RDMH023 (PSI5_RDM0_23_H)

/** \brief 6C0, Receive Data Memory Low 024 */
#define PSI5_RDM0_24_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00056C0u)
/** Alias (User Manual Name) for PSI5_RDM0_24_L.
* To use register names with standard convension, please use PSI5_RDM0_24_L.
*/
#define PSI5_RDML024 (PSI5_RDM0_24_L)

/** \brief 6C4, Receive Data Memory High 024 */
#define PSI5_RDM0_24_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00056C4u)
/** Alias (User Manual Name) for PSI5_RDM0_24_H.
* To use register names with standard convension, please use PSI5_RDM0_24_H.
*/
#define PSI5_RDMH024 (PSI5_RDM0_24_H)

/** \brief 6C8, Receive Data Memory Low 025 */
#define PSI5_RDM0_25_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00056C8u)
/** Alias (User Manual Name) for PSI5_RDM0_25_L.
* To use register names with standard convension, please use PSI5_RDM0_25_L.
*/
#define PSI5_RDML025 (PSI5_RDM0_25_L)

/** \brief 6CC, Receive Data Memory High 025 */
#define PSI5_RDM0_25_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00056CCu)
/** Alias (User Manual Name) for PSI5_RDM0_25_H.
* To use register names with standard convension, please use PSI5_RDM0_25_H.
*/
#define PSI5_RDMH025 (PSI5_RDM0_25_H)

/** \brief 6D0, Receive Data Memory Low 026 */
#define PSI5_RDM0_26_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00056D0u)
/** Alias (User Manual Name) for PSI5_RDM0_26_L.
* To use register names with standard convension, please use PSI5_RDM0_26_L.
*/
#define PSI5_RDML026 (PSI5_RDM0_26_L)

/** \brief 6D4, Receive Data Memory High 026 */
#define PSI5_RDM0_26_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00056D4u)
/** Alias (User Manual Name) for PSI5_RDM0_26_H.
* To use register names with standard convension, please use PSI5_RDM0_26_H.
*/
#define PSI5_RDMH026 (PSI5_RDM0_26_H)

/** \brief 6D8, Receive Data Memory Low 027 */
#define PSI5_RDM0_27_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00056D8u)
/** Alias (User Manual Name) for PSI5_RDM0_27_L.
* To use register names with standard convension, please use PSI5_RDM0_27_L.
*/
#define PSI5_RDML027 (PSI5_RDM0_27_L)

/** \brief 6DC, Receive Data Memory High 027 */
#define PSI5_RDM0_27_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00056DCu)
/** Alias (User Manual Name) for PSI5_RDM0_27_H.
* To use register names with standard convension, please use PSI5_RDM0_27_H.
*/
#define PSI5_RDMH027 (PSI5_RDM0_27_H)

