weifengdq/embedded/tc364/0_Board_Test_CAN_x8/Libraries/Infra/Sfr/TC36x/IfxPsi5_reg.h
/** \brief 784, Receive Data Memory High 116 */
#define PSI5_RDM1_16_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005784u)
/** Alias (User Manual Name) for PSI5_RDM1_16_H.
* To use register names with standard convension, please use PSI5_RDM1_16_H.
*/
#define PSI5_RDMH116 (PSI5_RDM1_16_H)

/** \brief 788, Receive Data Memory Low 117 */
#define PSI5_RDM1_17_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005788u)
/** Alias (User Manual Name) for PSI5_RDM1_17_L.
* To use register names with standard convension, please use PSI5_RDM1_17_L.
*/
#define PSI5_RDML117 (PSI5_RDM1_17_L)

/** \brief 78C, Receive Data Memory High 117 */
#define PSI5_RDM1_17_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000578Cu)
/** Alias (User Manual Name) for PSI5_RDM1_17_H.
* To use register names with standard convension, please use PSI5_RDM1_17_H.
*/
#define PSI5_RDMH117 (PSI5_RDM1_17_H)

/** \brief 790, Receive Data Memory Low 118 */
#define PSI5_RDM1_18_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005790u)
/** Alias (User Manual Name) for PSI5_RDM1_18_L.
* To use register names with standard convension, please use PSI5_RDM1_18_L.
*/
#define PSI5_RDML118 (PSI5_RDM1_18_L)

/** \brief 794, Receive Data Memory High 118 */
#define PSI5_RDM1_18_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005794u)
/** Alias (User Manual Name) for PSI5_RDM1_18_H.
* To use register names with standard convension, please use PSI5_RDM1_18_H.
*/
#define PSI5_RDMH118 (PSI5_RDM1_18_H)

/** \brief 798, Receive Data Memory Low 119 */
#define PSI5_RDM1_19_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005798u)
/** Alias (User Manual Name) for PSI5_RDM1_19_L.
* To use register names with standard convension, please use PSI5_RDM1_19_L.
*/
#define PSI5_RDML119 (PSI5_RDM1_19_L)

/** \brief 79C, Receive Data Memory High 119 */
#define PSI5_RDM1_19_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000579Cu)
/** Alias (User Manual Name) for PSI5_RDM1_19_H.
* To use register names with standard convension, please use PSI5_RDM1_19_H.
*/
#define PSI5_RDMH119 (PSI5_RDM1_19_H)

/** \brief 7A0, Receive Data Memory Low 120 */
#define PSI5_RDM1_20_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00057A0u)
/** Alias (User Manual Name) for PSI5_RDM1_20_L.
* To use register names with standard convension, please use PSI5_RDM1_20_L.
*/
#define PSI5_RDML120 (PSI5_RDM1_20_L)

/** \brief 7A4, Receive Data Memory High 120 */
#define PSI5_RDM1_20_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00057A4u)
/** Alias (User Manual Name) for PSI5_RDM1_20_H.
* To use register names with standard convension, please use PSI5_RDM1_20_H.
*/
#define PSI5_RDMH120 (PSI5_RDM1_20_H)

/** \brief 7A8, Receive Data Memory Low 121 */
#define PSI5_RDM1_21_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00057A8u)
/** Alias (User Manual Name) for PSI5_RDM1_21_L.
* To use register names with standard convension, please use PSI5_RDM1_21_L.
*/
#define PSI5_RDML121 (PSI5_RDM1_21_L)

/** \brief 7AC, Receive Data Memory High 121 */
#define PSI5_RDM1_21_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00057ACu)
/** Alias (User Manual Name) for PSI5_RDM1_21_H.
* To use register names with standard convension, please use PSI5_RDM1_21_H.
*/
#define PSI5_RDMH121 (PSI5_RDM1_21_H)

/** \brief 7B0, Receive Data Memory Low 122 */
#define PSI5_RDM1_22_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00057B0u)
/** Alias (User Manual Name) for PSI5_RDM1_22_L.
* To use register names with standard convension, please use PSI5_RDM1_22_L.
*/
#define PSI5_RDML122 (PSI5_RDM1_22_L)

/** \brief 7B4, Receive Data Memory High 122 */
#define PSI5_RDM1_22_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00057B4u)
/** Alias (User Manual Name) for PSI5_RDM1_22_H.
* To use register names with standard convension, please use PSI5_RDM1_22_H.
*/
#define PSI5_RDMH122 (PSI5_RDM1_22_H)

/** \brief 7B8, Receive Data Memory Low 123 */
#define PSI5_RDM1_23_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00057B8u)
/** Alias (User Manual Name) for PSI5_RDM1_23_L.
* To use register names with standard convension, please use PSI5_RDM1_23_L.
*/
#define PSI5_RDML123 (PSI5_RDM1_23_L)

/** \brief 7BC, Receive Data Memory High 123 */
#define PSI5_RDM1_23_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00057BCu)
/** Alias (User Manual Name) for PSI5_RDM1_23_H.
* To use register names with standard convension, please use PSI5_RDM1_23_H.
*/
#define PSI5_RDMH123 (PSI5_RDM1_23_H)

/** \brief 7C0, Receive Data Memory Low 124 */
#define PSI5_RDM1_24_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00057C0u)
/** Alias (User Manual Name) for PSI5_RDM1_24_L.
* To use register names with standard convension, please use PSI5_RDM1_24_L.
*/
#define PSI5_RDML124 (PSI5_RDM1_24_L)

/** \brief 7C4, Receive Data Memory High 124 */
#define PSI5_RDM1_24_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00057C4u)
/** Alias (User Manual Name) for PSI5_RDM1_24_H.
* To use register names with standard convension, please use PSI5_RDM1_24_H.
*/
#define PSI5_RDMH124 (PSI5_RDM1_24_H)

/** \brief 7C8, Receive Data Memory Low 125 */
#define PSI5_RDM1_25_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00057C8u)
/** Alias (User Manual Name) for PSI5_RDM1_25_L.
* To use register names with standard convension, please use PSI5_RDM1_25_L.
*/
#define PSI5_RDML125 (PSI5_RDM1_25_L)

/** \brief 7CC, Receive Data Memory High 125 */
#define PSI5_RDM1_25_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00057CCu)
/** Alias (User Manual Name) for PSI5_RDM1_25_H.
* To use register names with standard convension, please use PSI5_RDM1_25_H.
*/
#define PSI5_RDMH125 (PSI5_RDM1_25_H)

/** \brief 7D0, Receive Data Memory Low 126 */
#define PSI5_RDM1_26_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00057D0u)
/** Alias (User Manual Name) for PSI5_RDM1_26_L.
* To use register names with standard convension, please use PSI5_RDM1_26_L.
*/
#define PSI5_RDML126 (PSI5_RDM1_26_L)

/** \brief 7D4, Receive Data Memory High 126 */
#define PSI5_RDM1_26_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00057D4u)
/** Alias (User Manual Name) for PSI5_RDM1_26_H.
* To use register names with standard convension, please use PSI5_RDM1_26_H.
*/
#define PSI5_RDMH126 (PSI5_RDM1_26_H)

