weifengdq/embedded/tc364/0_Board_Test_CAN_x8/Libraries/Infra/Sfr/TC36x/IfxPsi5_reg.h
/** \brief 9E0, Receive Data Memory Low 328 */
#define PSI5_RDM3_28_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059E0u)
/** Alias (User Manual Name) for PSI5_RDM3_28_L.
* To use register names with standard convension, please use PSI5_RDM3_28_L.
*/
#define PSI5_RDML328 (PSI5_RDM3_28_L)

/** \brief 9E4, Receive Data Memory High 328 */
#define PSI5_RDM3_28_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059E4u)
/** Alias (User Manual Name) for PSI5_RDM3_28_H.
* To use register names with standard convension, please use PSI5_RDM3_28_H.
*/
#define PSI5_RDMH328 (PSI5_RDM3_28_H)

/** \brief 9E8, Receive Data Memory Low 329 */
#define PSI5_RDM3_29_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059E8u)
/** Alias (User Manual Name) for PSI5_RDM3_29_L.
* To use register names with standard convension, please use PSI5_RDM3_29_L.
*/
#define PSI5_RDML329 (PSI5_RDM3_29_L)

/** \brief 9EC, Receive Data Memory High 329 */
#define PSI5_RDM3_29_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059ECu)
/** Alias (User Manual Name) for PSI5_RDM3_29_H.
* To use register names with standard convension, please use PSI5_RDM3_29_H.
*/
#define PSI5_RDMH329 (PSI5_RDM3_29_H)

/** \brief 9F0, Receive Data Memory Low 330 */
#define PSI5_RDM3_30_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059F0u)
/** Alias (User Manual Name) for PSI5_RDM3_30_L.
* To use register names with standard convension, please use PSI5_RDM3_30_L.
*/
#define PSI5_RDML330 (PSI5_RDM3_30_L)

/** \brief 9F4, Receive Data Memory High 330 */
#define PSI5_RDM3_30_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059F4u)
/** Alias (User Manual Name) for PSI5_RDM3_30_H.
* To use register names with standard convension, please use PSI5_RDM3_30_H.
*/
#define PSI5_RDMH330 (PSI5_RDM3_30_H)

/** \brief 9F8, Receive Data Memory Low 331 */
#define PSI5_RDM3_31_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059F8u)
/** Alias (User Manual Name) for PSI5_RDM3_31_L.
* To use register names with standard convension, please use PSI5_RDM3_31_L.
*/
#define PSI5_RDML331 (PSI5_RDM3_31_L)

/** \brief 9FC, Receive Data Memory High 331 */
#define PSI5_RDM3_31_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059FCu)
/** Alias (User Manual Name) for PSI5_RDM3_31_H.
* To use register names with standard convension, please use PSI5_RDM3_31_H.
*/
#define PSI5_RDMH331 (PSI5_RDM3_31_H)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXPSI5_REG_H */
